tutorials/multiphase/interFoam/laminar/waves/solitaryMcCowan/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    right
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    ground
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    sides
    {
        type            slip;
    }

    top
    {
        type            totalPressure;
        U               U;
        phi             rhoPhi;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
